---
kind: property
id: P:Autodesk.Revit.DB.ColumnAttachment.AttachOffset
source: html/9b1311c9-7009-298c-dea9-f0a54ac18dee.htm
---
# Autodesk.Revit.DB.ColumnAttachment.AttachOffset Property

The offset of the column attachment.

## Syntax (C#)
```csharp
public double AttachOffset { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for attachOffset must be no more than 30000 feet in absolute value.